Documents/ВозвратПоПлатежнойКарте.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Document>
		<Properties>
			<Name>ВозвратПоПлатежнойКарте</Name>
			<BasedOn>
				<xr:Item>Document.ВозвратТоваровПоставщику</xr:Item>
				<xr:Item>Document.КомплексныйРасчетКлиента</xr:Item>
				<xr:Item>Document.ОплатаПлатежнойКартой</xr:Item>
			</BasedOn>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.ВзаиморасчетыСКлиентами</xr:Item>
				<xr:Item>AccumulationRegister.Оплаты</xr:Item>
				<xr:Item>AccumulationRegister.ДенежныеСредства</xr:Item>
				<xr:Item>AccumulationRegister.ДвиженияДенежныхСредств</xr:Item>
				<xr:Item>AccumulationRegister.омг_ОстаткиПредоплаты</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Клиент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Клиенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаДокумента</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Филиал</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Филиалы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтатьяДвиженияДенежныхСредств</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтатьиДвиженияДенежныхСредств</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерЧекаККМ</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>4</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерЧекаЭТ</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Выдать</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Основание</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Сделка</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.КомплексныйРасчетКлиента</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЭквайринговыйТерминал</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЭквайринговыеТерминалы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТелефонЧек</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АдресEmailЧек</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДокументОснование</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ВозвратПоПлатежнойКарте</v8:Type>
						<v8:Type>cfg:DocumentRef.ОказаниеУслуг</v8:Type>
						<v8:Type>cfg:DocumentRef.РасходныйКассовыйОрдер</v8:Type>
						<v8:Type>cfg:DocumentRef.ОплатаПлатежнойКартой</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаПечатиЧека</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФискальноеУстройство</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПодключаемоеОборудование</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СпособРасчетаЧекаККМ</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СпособыРасчетаЧекаККМ</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СсылочныйНомер</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерКарты</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтменаПлатежа</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВыдатьИНН</Name>
					<Comment>(Регл) Идентификационный номер налогоплательщика</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>12</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НеприменениеККТ</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипКоррекции</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОписаниеКоррекции</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>256</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаКоррекции</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерПредписания</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДополнительныйРеквизит</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Коррекция</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомераЧековСторно</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВыдатьАдрес</Name>
					<Comment>Адрес покупателя (клиента) (Тег 1254) – для расчетов между организациями (ИП).</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>256</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОперационныйРеквизит</Name>
					<Comment>Реквизит кассового чека - Тэг 1270</Comment>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>омг_ИспользуемыйТерминал</Name>
					<Type>
						<v8:Type>cfg:EnumRef.омг_ВидыТерминалов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>омг_НомерТранзакцииТерминала</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>омг_ВидОплаты</Name>
					<Type>
						<v8:Type>cfg:EnumRef.омг_ВидыОплаты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>КредитныеДанные</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Наименование</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>500</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаПриПокупке</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтавкаНДС</Name>
							<Type>
								<v8:Type>cfg:EnumRef.СтавкиНДС</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Enums/ТипыОплатыККТ.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Enum>
		<Properties>
			<Name>ТипыОплатыККТ</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Наличные</Name>
					<Comment>Оплата наличными средствами платежа</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Электронно</Name>
					<Comment>Оплата безналичными средствами платежа</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Предоплата</Name>
					<Comment>Зачет аванса и/или предыдущих платежей</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Постоплата</Name>
					<Comment>Подлежит последующей уплате (в кредит) </Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВстречноеПредоставление</Name>
					<Comment>Подлежит уплате встречным предоставлением</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>МобильныйПлатеж</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Documents/ВозвратПоПлатежнойКарте/Ext/ManagerModule.bsl
#Область ПрограммныйИнтерфейс

// Заполнить документ возврата по оплате платежной картой.
//
// Параметры:
//  ДокументОбъект	 - ДокументОбъект.ВозвратПоПлатежнойКарте - заполняемый документ.
//
Процедура ЗаполнитьВозвратПоОплатеПлатежнойКартой(ДокументОбъект) Экспорт
	
	СписокЗаполняемыхРеквизитов =	"Клиент,
									|СуммаДокумента,
									|Основание,
									|СпособРасчетаЧекаККМ,
									|СсылочныйНомер, 
	////////////////////////////////////////////////////////////
	// ОМГ                          
									|омг_ИспользуемыйТерминал,
	                                |омг_НомерТранзакцииТерминала,
									|ЭквайринговыйТерминал,
									|омг_ВидОплаты,
	// ОМГ
   ////////////////////////////////////////////////////////////												
									|НомерКарты";
									
	Если ДокументОбъект.Метаданные().Реквизиты.Найти("Сделка") <> Неопределено Тогда
		ОбщегоНазначенияКлиентСервер.КонкатенацияСтрок(СписокЗаполняемыхРеквизитов,"Сделка",",");
	КонецЕсли;								
									
	ЗаполнитьЗначенияСвойств(ДокументОбъект, ДокументОбъект.ДокументОснование, СписокЗаполняемыхРеквизитов);
	ДокументОбъект.Выдать = ДокументОбъект.ДокументОснование.ПринятоОт;
	ДокументОбъект.КредитныеДанные.Загрузить(ДокументОбъект.ДокументОснование.КредитныеДанные.Выгрузить());
	
	// Эквайринговый терминал заполняется из основания только если он - это настройка обмена с Системой быстрых платежей.
	ЭТОснования = ОбщегоНазначенияКлиентСервер.СвойствоОбъекта(ДокументОбъект.ДокументОснование, "ЭквайринговыйТерминал", Неопределено);
	Если ЗначениеЗаполнено(ЭТОснования)
		И ИнтеграцияСБП.ЭтоЭквайринговыйТерминалСБП(ЭТОснования)
	Тогда
		ДокументОбъект.ЭквайринговыйТерминал = ЭТОснования; 		
	КонецЕсли;
	
КонецПроцедуры
	
#КонецОбласти  
Функция СобратьДанныеЧеков(ДокументСсылка, НомерСекции, ВерсияФормата, СообщениеОбОшибке) Экспорт
	
	ТипРасчета = 2;		

	ПараметрыПечатиЧека = ПодготовитьПараметрыПечатиЧека(ДокументСсылка);
	
	РеквизитыПечатиЧека = ПараметрыПечатиЧека.РеквизитыПечатиЧека;
	Если РеквизитыПечатиЧека.Количество() = 0 Тогда
		Возврат Новый Структура;
	КонецЕсли;
	
	Реквизиты = ОбщегоНазначения.СтрокаТаблицыЗначенийВСтруктуру(РеквизитыПечатиЧека[0]);
			
	Реквизиты.Вставить("ТипРасчета",              ТипРасчета);
	Реквизиты.Вставить("НаименованиеВСтрокеЧека", НаименованиеВСтрокеЧека(Реквизиты));
	Реквизиты.Вставить("НомерСекции",             НомерСекции);
	
	Реквизиты.Вставить("ТипОплаты",               Перечисления.ТипыОплатыККТ.Электронно);

	Реквизиты.Вставить("ДокументОснование",        ДокументСсылка);
	
	ПараметрыОперацииФискализацииЧека = омг_WebKassa.ПараметрыОперацииФискализацииЧека(Реквизиты, ПараметрыПечатиЧека, ВерсияФормата, СообщениеОбОшибке);

	Возврат ПараметрыОперацииФискализацииЧека;  
	
КонецФункции     


Функция ПодготовитьПараметрыПечатиЧека(ДокументСсылка)
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ВозвратПоПлатежнойКарте", ДокументСсылка);
	Запрос.УстановитьПараметр("ВалютаРегламентированногоУчета", омг_WebKassa.ПолучитьВалютуРегламентированногоУчета());
	
	НомераТаблиц = Новый Структура;
	
	Запрос.Текст = ТекстЗапросаРеквизитыПечатиЧека(НомераТаблиц);
	
	Результат = Запрос.ВыполнитьПакет();
	
	ПараметрыПечатиЧека = Новый Структура;
	Для каждого НомерТаблицы Из НомераТаблиц Цикл
		ПараметрыПечатиЧека.Вставить(НомерТаблицы.Ключ, Результат[НомерТаблицы.Значение].Выгрузить());
	КонецЦикла;
	
	Возврат ПараметрыПечатиЧека;
КонецФункции



Функция ТекстЗапросаРеквизитыПечатиЧека(НомераТаблиц)
	
	НомераТаблиц.Вставить("РеквизитыПечатиЧека",      НомераТаблиц.Количество());
	НомераТаблиц.Вставить("РасшифровкаПлатежа",       НомераТаблиц.Количество());
		
	ТекстЗапроса =
	"ВЫБРАТЬ
	|	ВозвратПоПлатежнойКарте.Ссылка КАК Ссылка,
	|	ВозвратПоПлатежнойКарте.Дата КАК Дата,
	|	ВозвратПоПлатежнойКарте.Номер КАК Номер,
	|	ВозвратПоПлатежнойКарте.Филиал.Организация КАК Организация,
	|	ВозвратПоПлатежнойКарте.ДокументОснование КАК Основание,
	|	"""" КАК ВидОперации,
	|	ВозвратПоПлатежнойКарте.Клиент КАК Контрагент,
	|	ВозвратПоПлатежнойКарте.Клиент КАК Возвращено,
	|	ВозвратПоПлатежнойКарте.СуммаДокумента КАК СуммаДокумента,
	|	"""" КАК ВалютаДокумента,
	|	ВозвратПоПлатежнойКарте.ДокументОснование КАК ДокументРасшифровкиПозиций,
	|	ВозвратПоПлатежнойКарте.Клиент.ИНН КАК ПолучательИИН
	|ИЗ
	|	Документ.ВозвратПоПлатежнойКарте КАК ВозвратПоПлатежнойКарте
	|ГДЕ
	|	ВозвратПоПлатежнойКарте.Ссылка = &ВозвратПоПлатежнойКарте
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	"""" КАК Ссылка,
	|	"""" КАК ДоговорКонтрагента,
	|	"""" КАК СтавкаНДС,
	|	"""" КАК СуммаНДС,
	|	ВозвратПоПлатежнойКарте.СуммаДокумента КАК СуммаПлатежа,
	|	ВозвратПоПлатежнойКарте.СуммаДокумента КАК СуммаВзаиморасчетов
	|ИЗ
	|	Документ.ВозвратПоПлатежнойКарте КАК ВозвратПоПлатежнойКарте
	|ГДЕ
	|	ВозвратПоПлатежнойКарте.Ссылка = &ВозвратПоПлатежнойКарте";
	
	Возврат ТекстЗапроса + омг_WebKassa.ТекстРазделителяЗапросовПакета();
КонецФункции     

Функция НаименованиеВСтрокеЧека(СтруктураШапки)
	
	Если ЗначениеЗаполнено(СтруктураШапки.Возвращено) Тогда
		
		ШаблонНаименования = НСтр("ru = 'Возврат от: %1%2Основание: %3'");
		Возврат СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ШаблонНаименования, СтруктураШапки.Возвращено, " ", СтруктураШапки.Основание);
		
	Иначе
		
		ШаблонНаименования = НСтр("ru = 'Основание: %1'");
		Возврат СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ШаблонНаименования, СтруктураШапки.Основание);
		
	КонецЕсли;
	
КонецФункции
